app/controllers/api/v1/item_merchants_controller.rb

  def index
    item = Item.find(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 209], ["LIMIT", 1]]