app/controllers/api/v1/items_controller.rb

  def index
    @items = Item.limit(per_page).offset(page)
---
SELECT  "items".* FROM "items" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]

  def create
    item = Item.create(item_params)
---
INSERT INTO "items" ("name", "description", "unit_price", "merchant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    item = Item.find(params[:id])
    if item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2518], ["LIMIT", 1]]
UPDATE "items" SET "unit_price" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["unit_price", 65.23], ["updated_at", "2021-05-25 23:09:23.077212"], ["id", 179]]

  def destroy #fix to delete invoice if the item was the only one on it
    @item = Item.find(params[:id])
    render json: Item.delete(@item)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2520], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2520]]