app/controllers/api/v1/merchants_controller.rb

SELECT  "merchants".* FROM "merchants" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @merchants = Merchant.limit(per_page).offset(page)

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
  def show
    @merchant = Merchant.find(params[:id])

SELECT  "merchants".* FROM "merchants" WHERE (name ILIKE '%iLl%') ORDER BY "merchants"."name" ASC LIMIT $1  [["LIMIT", 1]]
---
  def find
    @merchant = Merchant.where("name ILIKE ?", "%#{params[:name]}%").order(:name).first